; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v11 ?v8)
             (pred_11 ?v9 ?v10)
             (pred_5 ?v11 ?v10)
             (pred_1 ?v5 ?v11 )
	     (pred_8 ?v11)
             (pred_6 ?v6)
             (pred_7 ?v9)
             (pred_2 ?v10)
             (pred_12 ?v11)
             (pred_4 ?v9)
             (pred_9 ?v11)
             (pred_3 ))



(:action op_3
:parameters (?v2 ?v4 ?v3 ?v7)
:precondition (and (pred_6 ?v2) (pred_6 ?v4) (pred_7 ?v3) (pred_2 ?v7)
          (pred_10 ?v2 ?v4) (pred_11 ?v3 ?v7)
                   (pred_5 ?v4 ?v7) (pred_8 ?v2) 
                   (pred_12 ?v4) (pred_4 ?v3))
:effect (and  (pred_9 ?v4) (not (pred_12 ?v4))))


(:action op_4
:parameters (?v2 ?v12)
:precondition (and (pred_6 ?v2) (pred_6 ?v12)
               (pred_8 ?v2) (pred_10 ?v2 ?v12) (pred_9 ?v12))
:effect (and (pred_8 ?v12) (not (pred_8 ?v2))))

(:action op_2
:parameters (?v2 ?v3)
:precondition (and (pred_6 ?v2) (pred_7 ?v3) 
                  (pred_8 ?v2) (pred_1 ?v3 ?v2) (pred_3 ))
:effect (and (pred_4 ?v3)
   (not (pred_1 ?v3 ?v2)) (not (pred_3 ))))


(:action op_1
:parameters (?v2 ?v1 ?v13)
:precondition (and (pred_6 ?v2) (pred_7 ?v1) (pred_7 ?v13)
                  (pred_8 ?v2) (pred_4 ?v13) (pred_1 ?v1 ?v2))
:effect (and (pred_4 ?v1) (pred_1 ?v13 ?v2)
        (not (pred_4 ?v13)) (not (pred_1 ?v1 ?v2))))

(:action op_5
:parameters (?v2 ?v3)
:precondition (and (pred_6 ?v2) (pred_7 ?v3) 
                  (pred_8 ?v2) (pred_4 ?v3))
:effect (and (pred_3 ) (pred_1 ?v3 ?v2) (not (pred_4 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_09 obj_15 obj_18 obj_23 obj_24 obj_07 obj_22 obj_14 obj_28 obj_26 obj_21 obj_01 obj_08 obj_03 obj_30 obj_19 obj_06 obj_12 obj_31 obj_16 obj_11 obj_10 obj_29 obj_20
    obj_25 obj_05 obj_27
    obj_02 obj_17 obj_04
    )

    (:init
       (pred_3)

       (pred_6 obj_13)
       (pred_6 obj_09)
       (pred_6 obj_15)
       (pred_6 obj_18)
       (pred_6 obj_23)
       (pred_6 obj_24)
       (pred_6 obj_07)
       (pred_6 obj_22)
       (pred_6 obj_14)
       (pred_6 obj_28)
       (pred_6 obj_26)
       (pred_6 obj_21)
       (pred_6 obj_01)
       (pred_6 obj_08)
       (pred_6 obj_03)
       (pred_6 obj_30)
       (pred_6 obj_19)
       (pred_6 obj_06)
       (pred_6 obj_12)
       (pred_6 obj_31)
       (pred_6 obj_16)
       (pred_6 obj_11)
       (pred_6 obj_10)
       (pred_6 obj_29)
       (pred_6 obj_20)
       (pred_2 obj_25)
       (pred_2 obj_05)
       (pred_2 obj_27)
       (pred_7 obj_02)
       (pred_7 obj_17)
       (pred_7 obj_04)

       (pred_10 obj_13 obj_24)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_09 obj_07)
       (pred_10 obj_09 obj_15)
       (pred_10 obj_09 obj_13)
       (pred_10 obj_15 obj_22)
       (pred_10 obj_15 obj_18)
       (pred_10 obj_15 obj_09)
       (pred_10 obj_18 obj_14)
       (pred_10 obj_18 obj_23)
       (pred_10 obj_18 obj_15)
       (pred_10 obj_23 obj_28)
       (pred_10 obj_23 obj_18)
       (pred_10 obj_24 obj_26)
       (pred_10 obj_24 obj_07)
       (pred_10 obj_24 obj_13)
       (pred_10 obj_07 obj_21)
       (pred_10 obj_07 obj_22)
       (pred_10 obj_07 obj_09)
       (pred_10 obj_07 obj_24)
       (pred_10 obj_22 obj_01)
       (pred_10 obj_22 obj_14)
       (pred_10 obj_22 obj_15)
       (pred_10 obj_22 obj_07)
       (pred_10 obj_14 obj_08)
       (pred_10 obj_14 obj_28)
       (pred_10 obj_14 obj_18)
       (pred_10 obj_14 obj_22)
       (pred_10 obj_28 obj_03)
       (pred_10 obj_28 obj_23)
       (pred_10 obj_28 obj_14)
       (pred_10 obj_26 obj_30)
       (pred_10 obj_26 obj_21)
       (pred_10 obj_26 obj_24)
       (pred_10 obj_21 obj_19)
       (pred_10 obj_21 obj_01)
       (pred_10 obj_21 obj_07)
       (pred_10 obj_21 obj_26)
       (pred_10 obj_01 obj_06)
       (pred_10 obj_01 obj_08)
       (pred_10 obj_01 obj_22)
       (pred_10 obj_01 obj_21)
       (pred_10 obj_08 obj_12)
       (pred_10 obj_08 obj_03)
       (pred_10 obj_08 obj_14)
       (pred_10 obj_08 obj_01)
       (pred_10 obj_03 obj_31)
       (pred_10 obj_03 obj_28)
       (pred_10 obj_03 obj_08)
       (pred_10 obj_30 obj_16)
       (pred_10 obj_30 obj_19)
       (pred_10 obj_30 obj_26)
       (pred_10 obj_19 obj_11)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_19 obj_21)
       (pred_10 obj_19 obj_30)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_06 obj_12)
       (pred_10 obj_06 obj_01)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_12 obj_29)
       (pred_10 obj_12 obj_31)
       (pred_10 obj_12 obj_08)
       (pred_10 obj_12 obj_06)
       (pred_10 obj_31 obj_20)
       (pred_10 obj_31 obj_03)
       (pred_10 obj_31 obj_12)
       (pred_10 obj_16 obj_11)
       (pred_10 obj_16 obj_30)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_11 obj_19)
       (pred_10 obj_11 obj_16)
       (pred_10 obj_10 obj_29)
       (pred_10 obj_10 obj_06)
       (pred_10 obj_10 obj_11)
       (pred_10 obj_29 obj_20)
       (pred_10 obj_29 obj_12)
       (pred_10 obj_29 obj_10)
       (pred_10 obj_20 obj_31)
       (pred_10 obj_20 obj_29)
       (pred_12 obj_01)
       (pred_12 obj_24)
       (pred_12 obj_19)
       (pred_5  obj_01 obj_25)
       (pred_5  obj_24 obj_05)
       (pred_5  obj_19 obj_27)
       (pred_9 obj_13)
       (pred_9 obj_09)
       (pred_9 obj_15)
       (pred_9 obj_18)
       (pred_9 obj_23)
       (pred_9 obj_07)
       (pred_9 obj_22)
       (pred_9 obj_14)
       (pred_9 obj_28)
       (pred_9 obj_26)
       (pred_9 obj_21)
       (pred_9 obj_08)
       (pred_9 obj_03)
       (pred_9 obj_30)
       (pred_9 obj_06)
       (pred_9 obj_12)
       (pred_9 obj_31)
       (pred_9 obj_16)
       (pred_9 obj_11)
       (pred_9 obj_10)
       (pred_9 obj_29)
       (pred_9 obj_20)

       (pred_11  obj_02 obj_25)
       (pred_11  obj_17 obj_05)
       (pred_11  obj_04 obj_27)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_17 obj_13)
       (pred_1 obj_04 obj_12)
       (pred_8 obj_15)
    )

    (:goal (and
       (pred_1 obj_02 obj_21)
       (pred_1 obj_17 obj_22)
    ))
(:constraints
  (always (not (pred_8 obj_07)))
)
)

; plan
1. (op_4 obj_15 obj_09)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_09)
   goals met: 0 of 2
2. (op_4 obj_09 obj_13)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_13)
   goals met: 0 of 2
3. (op_2 obj_13 obj_17)
   deleted: (pred_1 obj_17 obj_13) (pred_3)
   added: (pred_4 obj_17)
   goals met: 0 of 2
4. (op_4 obj_13 obj_09)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_09)
   goals met: 0 of 2
5. (op_4 obj_09 obj_15)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_15)
   goals met: 0 of 2
6. (op_4 obj_15 obj_22)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_22)
   goals met: 0 of 2
7. (op_5 obj_22 obj_17)
   deleted: (pred_4 obj_17)
   added: (pred_3) (pred_1 obj_17 obj_22)
   goals met: 1 of 2
8. (op_4 obj_22 obj_14)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_14)
   goals met: 1 of 2
9. (op_4 obj_14 obj_08)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_08)
   goals met: 1 of 2
10. (op_4 obj_08 obj_12)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_12)
   goals met: 1 of 2
11. (op_2 obj_12 obj_04)
   deleted: (pred_1 obj_04 obj_12) (pred_3)
   added: (pred_4 obj_04)
   goals met: 1 of 2
12. (op_4 obj_12 obj_06)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_06)
   goals met: 1 of 2
13. (op_4 obj_06 obj_10)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_10)
   goals met: 1 of 2
14. (op_4 obj_10 obj_11)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_11)
   goals met: 1 of 2
15. (op_3 obj_11 obj_19 obj_04 obj_27)
   deleted: (pred_12 obj_19)
   added: (pred_9 obj_19)
   goals met: 1 of 2
16. (op_1 obj_11 obj_02 obj_04)
   deleted: (pred_4 obj_04) (pred_1 obj_02 obj_11)
   added: (pred_4 obj_02) (pred_1 obj_04 obj_11)
   goals met: 1 of 2
17. (op_4 obj_11 obj_19)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_19)
   goals met: 1 of 2
18. (op_4 obj_19 obj_21)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_21)
   goals met: 1 of 2
19. (op_5 obj_21 obj_02)
   deleted: (pred_4 obj_02)
   added: (pred_3) (pred_1 obj_02 obj_21)
   goals met: 2 of 2
